In [25]:
#importation des librairies
import pandas as pd
import numpy as np

In [26]:
#afficher le dataframe
data_clearing = pd.read_csv('data_file.csv')

In [28]:
#afficher le nombre de colonnes et lignes
data_clearing.shape

(18241, 6)

In [29]:
#Type de données
data_clearing.dtypes

Unnamed: 0          int64
City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [30]:
#afficher les cinq premières lignes
data_clearing.head()

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [31]:
#Statistiques
data_clearing.describe()

         Unnamed: 0
count  18241.000000
mean    9120.000000
std     5265.867466
min        0.000000
25%     4560.000000
50%     9120.000000
75%    13680.000000
max    18240.000000

In [32]:
#Repérage des valeurs manquantes
data_clearing.isna().sum()

Unnamed: 0             0
City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [33]:
#Repérage des valeurs dupliquées
data_clearing.duplicated().sum()

0

In [34]:
del data_clearing["Unnamed: 0"]

In [35]:
data_clearing.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [37]:
data_clearing['Colors Reported'].isna().describe()

count     18241
unique        2
top        True
freq      15359
Name: Colors Reported, dtype: object

In [38]:
#Pourcentage des valeurs manquante sur la colonne Colors Reported
15364*100/18241

84.22783838605339

In [40]:
#supprimer la colonne Colors Reported
del data_clearing['Colors Reported']

In [41]:
data_clearing

                       City Shape Reported State              Time
0                    Ithaca       TRIANGLE    NY    6/1/1930 22:00
1               Willingboro          OTHER    NJ   6/30/1930 20:00
2                   Holyoke           OVAL    CO   2/15/1931 14:00
3                   Abilene           DISK    KS    6/1/1931 13:00
4      New York Worlds Fair          LIGHT    NY   4/18/1933 19:00
...                     ...            ...   ...               ...
18236            Grant Park       TRIANGLE    IL  12/31/2000 23:00
18237           Spirit Lake           DISK    IA  12/31/2000 23:00
18238           Eagle River            NaN    WI  12/31/2000 23:45
18239           Eagle River          LIGHT    WI  12/31/2000 23:45
18240                  Ybor           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [42]:
#Remplacer les valeurs manquantes par la valeur par défaut ‘VARIOUS’ dans la colonne 'Shape Reported'
data_clearing['Shape Reported'].fillna('VARIOUS',inplace=True)

In [43]:
data_clearing['Shape Reported'].isna().sum()

0

In [45]:
# repérer les données dupliquées
data_clearing.duplicated().sum()

149

In [47]:
#supprimer les données dupliquées
data=data_clearing.drop_duplicates()

In [48]:
data.duplicated().sum()

0

In [50]:
data_clearing.describe()

           City Shape Reported  State              Time
count     18216          18241  18241             18241
unique     6476             27     52             16145
top     Seattle        VARIOUS     CA  11/16/1999 19:00
freq        187           2977   2529                27

In [52]:
#Renommer les colonnes 'Shape Reported', 'Colors Reported' respectivement en
#‘Forme’ et ‘Couleur’
data_clearing.rename(columns={'Shape Reported':'Forme'},inplace=True)

In [55]:
#Réindexer les données selon l’ordre suivant : 'City', 'Forme',
#'Couleur','State','Time'.
colonnes=['City', 'Forme','State','Time']
new_data=data_clearing[colonnes]

In [56]:
data_clearing.describe()

           City    Forme  State              Time
count     18216    18241  18241             18241
unique     6476       27     52             16145
top     Seattle  VARIOUS     CA  11/16/1999 19:00
freq        187     2977   2529                27